import 'dart:math';

import 'package:flutter/material.dart';

List colorstile = [Colors.grey,Colors.grey,Colors.grey,Colors.grey];
List IconsTile = [Icons.quiz,Icons.close,Icons.close,Icons.close,];
List PlayerArray = [];
int playernum = 3;
int turnCounter = 0;

List sample_data = [
  {"id":1,
    "question":"أول صحابي حيّا الرسول صلى الله عليه وسلم بتحية الإسلام هو…؟",
    "options":["أبو بكر الصديق","أبو أيوب الأنصاري","أبو ذر الغفاري","أبو موسى الأشعري"],
    "answer_index":2
  },
  {"id":2,
    "question":"ما هو البحر الذي يسمى بحر القلزم؟",
    "options":["البحر العربي","البحر الأحمر","بحر قزوين","البحر الأسود"],
    "answer_index":0
  },
  {"id":3,
    "question":"أسماء بنت عمرو بن عدي ونسيبة بنت كعب بايعتا الرسول صلى الله عليه وسلم في بيعة العقبة الثانية في بيعة…؟",
    "options":["العقبة الاولى","العقبة الثانية","بيعة الرضوان","غير مذكور"],
    "answer_index":2
  },
  {"id":4,
    "question":"النحلة ترفرف بجناحيها في الثانية الواحدة بمعدل….؟",
    "options":["150 مرة","250 مرة","350 مرة","550 مرة"],
    "answer_index":2
  },
  {"id":5,
    "question":"العالم الذي أخترع التلفون هو…؟",
    "options":["الكسندر غراهام بيل","جوزف برستلي","بجوار سيكو رسكي","فلهلم رونتفن"],
    "answer_index":0
  },
  {"id":6,
    "question":"من مؤ لفات الطبيب العربي أبو بكر الرازي كتاب ..؟",
    "options":["الطب والحكمة","فردوس الحكمة","الأدوية والعلل","هيئة الكبد"],
    "answer_index":3
  },
  {"id":7,
    "question":"قال تعالى(وزرابي مبثوثة)سورة الغاشية(16) المقصود بـ(زرابي) هي …؟",
    "options":["الطنافس","الأسرة","الوسائد","الفرش"],
    "answer_index":0
  },
  {"id":8,
    "question":"اذا قطع المسلم إحدى شفتي أخيه المسلم فيجب عليه أن يسلم له…؟",
    "options":["دية النفس كاملة","نصف الدية","ثلث الدية","ربع الدية"],
    "answer_index":1
  },
  {"id":9,
    "question":"تصل مده حمل أنثى الفيل إلى…؟",
    "options":["12 شهر","18 شهر","22 شهراً","32 شهر"],
    "answer_index":2
  },
  {"id":10,
    "question":"ما المقصود بيوم الفرقان الذي ذكره الله تعالى في القرآن؟",
    "options":["غزوة بدر","غزوة أحد","فتح مكة","غزوة تبوك"],
    "answer_index":0
  },
  {"id":11,
    "question":"من شعراء العصر الأموي ..؟",
    "options":["أبو الطيب المتنبي","ابن خفاجي الأندلسي","ابن هانئ الأندلسي","الكميت"],
    "answer_index":3
  },
  {"id":12,
    "question":"يضرب به المثل في الحلم فيقال أحلم من …؟",
    "options":["الأحنف بن حسان","الأحنف بن قيس","المهلب بن صفرة","المهلب بن حاتم"],
    "answer_index":1
  },
  {"id":13,
    "question":"اكبر دولة افريقية من حيث المساحة هي دولة …؟",
    "options":["الجزائر","مورتانيا","مصر","السودان"],
    "answer_index":3
  },
  {"id":14,
    "question":"الغاز الذي يشكل حوالي 75 %من اجمالي كتلة الشمس هو…؟",
    "options":["النتروجين","الأوكسجين","الهيدروجين","الكالسيوم"],
    "answer_index":2
  },
  {"id":15,
    "question":"صاحب كتاب (حي إبن يقظان) هو..؟",
    "options":["إبن رشد","ابن خلدون","إبن عربي","إبن طفيل"],
    "answer_index":3
  },
  {"id":16,
    "question":"المد في قوله تعالى(ويزداد الذينَ ءامنوا إيماناً) مد..؟",
    "options":["مد اللين","مد العوض","مد البدل","مد الصلة القصيرة"],
    "answer_index":2
  },
  {"id":17,
    "question":"ما العاصمة الأوربية التي تقع على ضفاف نهر التيبر؟",
    "options":["مدينة باريس","مدينة مدريد","مدينة لندن","مدينة روما"],
    "answer_index":3
  },
  {"id":18,
    "question":"ما نظام الحكم في جزر القمر الاتحادية الإسلامية؟",
    "options":["جمهوري","ملكي","فدرالي","أماراة"],
    "answer_index":0
  },
  {"id":19,
    "question":"أقسم الله عزوجل بالتين والزيتون كناية عن الأرض التي تزرع فيها ومهبط الرسالات السماوية وهي أرض …؟",
    "options":["مصر","الحجاز","فلسطين","اليمن"],
    "answer_index":2
  },
  {"id":20,
    "question":"الماء الذي يتجمد على نحو أسرع عند وضعه في داخل الفريزر هو…؟",
    "options":["الماء البارد","الماء المعتدل","الماء الساخن","كلها في وقت واحد"],
    "answer_index":2
  },
  {"id":21,
    "question":"بدأت سورة الشعراء بعد البسملة بثلاثة حروف هي..؟",
    "options":["طسم","الم","الر","كهع"],
    "answer_index":0
  },
  {"id":22,
    "question":"اذا ضرب المسلم أخاه المسلم ونتج عن ذلك فقدانه للنطق فمقدار الدية التي يجب عليه دفعها في الشريعة الإسلامية هي…؟",
    "options":["دية النفس كاملة","نصف الدية","ثلث الدية","عشر الدية"],
    "answer_index":0
  },
  {"id":23,
    "question":"الطائر الوحيد الذي يستطيع تمييز اللون الأزرق هو ….؟",
    "options":["الهدهد","الغراب","البومة","الصقر"],
    "answer_index":2
  },
  {"id":24,
    "question":"من قائد المسلمين في معركة القادسية؟",
    "options":["خالد بن الوليد","عمرو بن العاص","سعد بن أبي وقاص","شرحبيل بن حسنة"],
    "answer_index":2
  },
  {"id":25,
    "question":"يضرب به المثل في الحفظ فيقال أحفظ من ….؟",
    "options":["الشافعي","الشعبي","ابن عباس","شريح"],
    "answer_index":1
  },
  {"id":27,
    "question":"الغزوة التي تسمى غزوة أوطاس أيضاَ هي غزوة..؟",
    "options":["بدر","بني قينقاع","مؤته","حنين"],
    "answer_index":3
  },
  {"id":28,
    "question":"البردة قصيدة في مدح الرسول صلى الله عليه وسلم للشاعر…؟",
    "options":["كعب بن زهير","حسان بن ثابت","لبيد بن ربيعة","عمرو بن معد يكرب الزبيدي"],
    "answer_index":0
  },
  {"id":29,
    "question":"يعرف علم دراسة أنشطة أعضاء الجسم ووظائفها بـ..؟",
    "options":["علم الطب البيولوجي","علم الطب الفسيولوجي","علم الطب الايثلوجي","علم الطب الحيوي"],
    "answer_index":1
  },
  {"id":30,
    "question":"من مؤلفات أبو حامد الغزالي كتاب..؟",
    "options":["نيل الأوطار","فتح الباري","المنقذ من الضلال","سماحة الإسلام"],
    "answer_index":2
  },
  {"id":31,
    "question":"ما هو اسم ابن الضبع؟",
    "options":["الفرعل","الدب","الأرنب","الثعلب"],
    "answer_index":0
  },
  {"id":32,
    "question":"ما هي أسرع سمكة بحرية؟",
    "options":["الدولفين","الحوت الازرق","سمكة التونة العنيدة","ابو منشار"],
    "answer_index":3
  },
  {"id":33,
    "question":"فتحت أصبهان على يد؟",
    "options":["طريف بن مالك","عبد الرحمن بن عوف","عبد الله بن بديل","نعمان بن مقرن"],
    "answer_index":3
  },
  {"id":34,
    "question":"فتحت أصبهان على يد؟",
    "options":["طريف بن مالك","عبد الرحمن بن عوف","عبد الله بن بديل","نعمان بن مقرن"],
    "answer_index":2
  },
  {"id":35,
    "question":"من باني ومؤسس مدينة القطائع؟",
    "options":["المنصور بن أبي عامر","أحمد بن طولون","أبو جعفر المنصور","جوهر الصقلي"],
    "answer_index":1
  },
  {"id":36,
    "question":"صوت العرير هو صوت؟",
    "options":["الذباب","الفأر","الجراد","الصرصار"],
    "answer_index":3
  },
  {"id":37,
    "question":"ما هي أكثر سورة قد ورد فيها اسم مريم؟",
    "options":["المائدة","القصص","آل عمران","مريم"],
    "answer_index":0
  },
  {"id":38,
    "question":"صوت الزمار هو صوت؟",
    "options":["البومة","الطاووس","النعامة","اليمامة"],
    "answer_index":2
  },
  {"id":39,
    "question":"من هي الدولة الإفريقية الثانية من حيث المساحة؟",
    "options":["مصر","السودان","تونس","الجزائر"],
    "answer_index":1
  },
  {"id":40,
    "question":"ماذا يطلق على صوت النسر؟",
    "options":["صليل","نعيق","صياح","صفير"],
    "answer_index":3
  },
  {"id":41,
    "question":"ماذا يطلق على صوت العصفور؟",
    "options":["صياح","تغريد","طنين","صرير"],
    "answer_index":0
  },
  {"id":42,
    "question":"كم ورد اسم نبي الله نوح في القرآن الكريم؟",
    "options":["50 مرة","22 مرة","43 مرة","ولا مرة"],
    "answer_index":2
  },
  {"id":43,
    "question":"ما هو الطائر الوحيد الذي باستطاعته تمييز اللون الأزرق؟",
    "options":["النسر","البومة","الصقر","الهدهد"],
    "answer_index":1
  },
  {"id":44,
    "question":"من هو الحيوان الذي يضرب به المثل في الوفاء؟",
    "options":["اسد","حمار","كلب","قط"],
    "answer_index":2
  },
  {"id":45,
    "question":"ما عاصمة جمهورية السينغال؟",
    "options":["انقرة","اثينا","القاهرة","داكار"],
    "answer_index":3
  },
  {"id":46,
    "question":"من هما الصحابيان اللذان أرسلهما النبي عليه الصلاة والسلام للمدينة المنورة بعد بيعة العقبة الأولى مصعب بن عمير و؟",
    "options":["عمرو بن أم مكتوم","عمر بن الخطاب","معاذ بن جبل","عبد الله بن عمر"],
    "answer_index":0
  },
  {"id":47,
    "question":"ماذا يطلق على ابن الذئب؟",
    "options":["دعفل","الرآل","الغلو","الديسم"],
    "answer_index":2
  },
  {"id":48,
    "question":"ما هي المعركة التي كانت يوم 28 يونيو سنة 1815 ميلاديًا وكانت بين نابليون ودول التحالف وقد أنتهت المعركة بهزيمة نابليون ووقوعه في الأسر؟",
    "options":["معركة باريس","معركة ذات الصواري","معركة وسلو","معركة واترلو"],
    "answer_index":3
  },
  {"id":49,
    "question":" الطبيب العربي الذي كان أول من اكتشف خراج البلعوم والتهاب الناسور؟",
    "options":["أبو بكر الرازي","أبو العلاء ابن زهر","ابن بطوطة","ابن سينا"],
    "answer_index":1
  },
  {"id":50,
    "question":"يسمى مرور الضوء من خلال المنشور الزجاجي وانحنائه",
    "options":["الانعكاس","الانكسار","الانحراف","الاستيعاب"],
    "answer_index":1
  },
  {"id":51,
    "question":"ما عدد الدول العربية الموجودة في قارة أفريقيا ؟",
    "options":["15","10","9","8"],
    "answer_index":1
  },
  {"id":52,
    "question":"ما هو الحيوان الذي إذا قطعت إحدى أذرعته تنمو مرة أخرى ؟",
    "options":["حيوان نجم البحر","الدولفين","الثعلب","السحلية"],
    "answer_index":0
  },
  {"id":53,
    "question":"ما أصل كلمة أطلس التي تطلق على كتاب الخرائط ؟",
    "options":["عربية","إغريقية","يونانية","فارسية"],
    "answer_index":2
  },
  {"id":54,
    "question":"ما هو أول البنوك التي مارست نشاطها في السعودية ؟",
    "options":["البنك العربي","البنك الهولندي","البنك المغربي","البنك السعودي"],
    "answer_index":3
  },
  {"id":55,
    "question":"أين توجد أكبر غابة موجودة في العالم ؟",
    "options":["الهند","المانيا","روسيا","باكستان"],
    "answer_index":2
  },
  {"id":56,
    "question":"أين توجد ساعة البيج بن ؟",
    "options":["لندن","شيكاغو","باريس","روما"],
    "answer_index":0
  },
  {"id":57,
    "question":"في أي مكان تم وضع تمثال الحرية ؟",
    "options":["واشنطن","إنجلترا","باريس","نيويورك"],
    "answer_index":3
  },
  {"id":58,
    "question":"أين توجد أعلي وأكبر نافورة في العالم ؟",
    "options":["جدة","باريس","الرياض","دبي"],
    "answer_index":0
  },
  {"id":59,
    "question":"من هو الحيوان الذي تم اتهامه بالكذب في قصص الأنبياء ؟",
    "options":["ناقة صالح","ذئب يوسف","فيل أبرهة الحبشي","هدد سليمان"],
    "answer_index":1
  },
  {"id":60,
    "question":"ما هو الاسم الذي يطلق على صغير حيوان الفيل ؟",
    "options":["دغفل","شبل","جرو","هجرس"],
    "answer_index":0
  },
  {"id":61,
    "question":"من كان الوصيف في بطولة كوبا أمريكا 2016 ؟",
    "options":["تشيلي","كولومبيا","الأرجنتين","ألاوروجواي"],
    "answer_index":2
  },
  {"id":62,
    "question":"كم مرة فازت فرنسا بكأس العالم fifa ؟",
    "options":["مرة وحيدة","مرتين","3 مرات","4 مرات"],
    "answer_index":1
  },
  {"id":63,
    "question":"من أصبح المدرب الجديد لنادي ارسنال بعد ارسين فينجر؟",
    "options":["دافيد مويس","ماسيميليانو أليغري","أوناي إيمري","ميكيل أرتيتا"],
    "answer_index":2
  },
  {"id":64,
    "question":"من اي فريق تعاقد مانشستر يونايتد مع انتوني مارسيال؟",
    "options":["ليل","موناكو","مارسيليا","ليون"],
    "answer_index":1
  },
  {"id":65,
    "question":"من هو الهداف التاريحي للدوري الانجليزي الممتاز؟",
    "options":["واين روني","اندي كول","الان شيرار","تييري هنري"],
    "answer_index":2
  },
  {"id":66,
    "question":"من اي فريق تعاقد ريال مدريد مع البرازيلي مارسيلو ؟",
    "options":["فلومينينسي","سانتوس","فلامينغو","فاسكو دي جاما"],
    "answer_index":0
  },
  {"id":67,
    "question":"من كان مدرب تشيلسي قبل مجيء جوزيه موينيو 2014 ؟",
    "options":["جيانلوكا فيالي","غلين هودل","روود خولييت","كلاوديو رانييري"],
    "answer_index":3
  },
  {"id":68,
    "question":"متى كانت النسخة الاولى من بطولة امم اوروبا ؟",
    "options":["1970","1960","1962","1961"],
    "answer_index":1
  },
  {"id":69,
    "question":"متى كانت اول مرة يشارك فيها المنتخب المغربي في بطولة كأس العالم ؟",
    "options":["1970","1982","1966","1990"],
    "answer_index":0
  },
  {"id":70,
    "question":"ما هو الاسم الاول للاعب البرازيلي كاسيميرو ؟",
    "options":["البيرتو","جابرييل","كارلوس","دانييل"],
    "answer_index":3
  },
  {"id":71,
    "question":"كم كانت نتيجة نهائي دوري الابطال بين ريال مدريد وفرانكفورت في عام 1959-60 ؟",
    "options":["5-3","7-3","2-0","6-2"],
    "answer_index":1
  },
  {"id":72,
    "question":"المانشافت هو لقب لأي منتخب ؟",
    "options":["روسيا","إيطاليا","الأوروغواي","المانيا"],
    "answer_index":3
  },
  {"id":73,
    "question":"بطل كوبا أمريكا عام 2015 ؟",
    "options":["البرازيل","كولومبيا","تشيلي","الارجنتين"],
    "answer_index":2
  },
  {"id":74,
    "question":"من اللاعب الذي لقب بالقيصر ؟",
    "options":["مولر","يوفنتوس","بيكنباور","رومينيغه"],
    "answer_index":2
  },
  {"id":75,
    "question":"من هو افضل لاعب في اوروبا 1998 ؟",
    "options":["ريفالدو","زيدان","رونالدو","باتيستوتا"],
    "answer_index":1
  },
  {"id":76,
    "question":"من هو اول لاعب يسجل في 6 مسابقات مختلف للاندية في موسم واحد ؟",
    "options":["فيا","إيتو","ميسي","بيدرو"],
    "answer_index":3
  },
  {"id":77,
    "question":"من سجل الهدف الوحيد في نهائي دوري الابطال بين بايرن ميونيخ وباريس في موسم 2019-20 ؟",
    "options":["كومان","ليفاندوفسكي","مولر","جنابري"],
    "answer_index":0
  },
  {"id":78,
    "question":"اي دولة فازت بأول كأس عالم على الاطلاق عام 1930 ؟",
    "options":["البارجواي","البرازيل","الاوروجواي","فرنسا"],
    "answer_index":2
  },
  {"id":79,
    "question":"من هو اللاعب الوحيد الذي فاز بدوري الابطال م ع ثلاثة اندية مختلفة ؟",
    "options":["ألونسو","سيدورف","إنزاغي","إيتو"],
    "answer_index":1
  },
  {"id":80,
    "question":"كم عدد أهداف كريستيانو رونالدو بقميص ريال مدريد ؟",
    "options":["350","450","250","550"],
    "answer_index":1
  },
  {"id":81,
    "question":"متى كان اول موسم للاسم الجديد للدوري الانجليزي (البريميرليغ) ؟",
    "options":["1987","1889","1990","1992"],
    "answer_index":3
  },
  {"id":82,
    "question":"اي نادي فاز بكاس السوبر الاوروبي 2017 ؟",
    "options":["مانشستر يونايتد","ريال مدريد","بايرن ميونيخ","برشلونة"],
    "answer_index":1
  },
  {"id":83,
    "question":"من سجل هدف البرازيل الوحيد في هزيمتها امام المانيا في كأس العالم 2014 ؟",
    "options":["نيمار","ويليان","أوسكار","مارسيلو"],
    "answer_index":2
  },
  {"id":84,
    "question":"كم عدد الاندية التي لعب فيها ديفيد بيكهام خلال مسيرته ؟",
    "options":["6","8","3","4"],
    "answer_index":0
  },
  {"id":85,
    "question":"من هو اللاعب الذي حصل على جائزة الكرة الذهبية لعام 2006 ؟",
    "options":["زيدان","رونالدو الظاهرة","رونالدينهو","كانافارو"],
    "answer_index":3
  },
  {"id":86,
    "question":"من صاحب اسرع هدف في تاريخ دوري ابطال اوروبا ؟",
    "options":["ماكاي","جوناس أوليفييرا","سيدورف","ديل بييرو"],
    "answer_index":0
  },
  {"id":87,
    "question":"النادي الوحيد الذي لم يخسر في موسم واحد في تاريخ البريميرليح ؟",
    "options":["ليفربول","تشيلسي","ارسنال","مانشستر يونايتد"],
    "answer_index":2
  },
  {"id":88,
    "question":"ما نوع الحيوان الذي يظهر على شعار نادي ليستر سيتي ؟",
    "options":["كلب","ثعلب","قطة","ذئب"],
    "answer_index":1
  },
  {"id":88,
    "question":"كم عدد الفرق المشاركة في بطولة كأس العالم ؟",
    "options":["64","28","16","32"],
    "answer_index":3
  },
  {"id":89,
    "question":"من هو اصغر لاعب يسجل هدفاً في تاريخ دوري ابطال اوروبا ؟",
    "options":["روني","كانو","فاتي","أوفوري-كواي"],
    "answer_index":2
  },
  {"id":90,
    "question":"في اي نادي ظهر زين الدين زيدان لاول مرة ؟",
    "options":["يوفنتوس","ريال مدريد","كان","بوردو"],
    "answer_index":2
  },
  {"id":91,
    "question":"3 اندية لم تهبط الى الدرجة الثانية في الدوري الاسباني ريال مدريد وبرشلونة و ؟",
    "options":["إشبيلية","اتلتيك بيلباو","اتلتيكو مدريد","فياريال"],
    "answer_index":1
  },
  {"id":92,
    "question":"ملعب لا بومبونيرا لاي نادي ينتمي ؟",
    "options":["سان لورينزو","ريفر بليت","إنديبندينتي","بوكا جونيورز"],
    "answer_index":3
  },
  {"id":93,
    "question":"اي منتخب فاز بكأس الامم الافريقية لعام 2010؟",
    "options":["مصر","ساحل العاج","غانا","تونس"],
    "answer_index":0
  },];
bool checkAns(int QuestionIndex,int SelectedAnswer)
  {
    var CorrectAnswer = sample_data[QuestionIndex]["answer_index"];
    if(CorrectAnswer == SelectedAnswer) {
      print("Correct!");
      return true;
    } else {
      print("False");
      return false;
    }
  }
int RandomNum()
{
  var num = new Random();
  int random = num.nextInt(sample_data.length);
  return random;
}




